const months: Record<string, string> = {
    "01": "януари",
    "02": "февруари",
    "03": "март",
    "04": "април",
    "05": "май",
    "06": "юни",
    "07": "юли",
    "08": "август",
    "09": "септември",
    "10": "октомври",
    "11": "ноември",
    "12": "декември"
};

const dayOrdinals: Record<number, string> = {
    1: "първи",
    2: "втори",
    3: "трети",
    4: "четвърти",
    5: "пети",
    6: "шести",
    7: "седми",
    8: "осми",
    9: "девети",
    10: "десети",
    11: "единадесети",
    12: "дванадесети",
    13: "тринадесети",
    14: "четиринадесети",
    15: "петнадесети",
    16: "шестнадесети",
    17: "седемнадесети",
    18: "осемнадесети",
    19: "деветнадесети",
    20: "двадесети",
    21: "двадесет и първи",
    22: "двадесет и втори",
    23: "двадесет и трети",
    24: "двадесет и четвърти",
    25: "двадесет и пети",
    26: "двадесет и шести",
    27: "двадесет и седми",
    28: "двадесет и осми",
    29: "двадесет и девети",
    30: "тридесети",
    31: "тридесет и първи"
};

export function formatDateWordsBg(date: string): string {
    const [dayRaw, monthRaw, yearRaw] = date.split(".");

    const day = Number(dayRaw);
    const month = months[monthRaw];

    if (!dayOrdinals[day] || !month || !yearRaw) {
        return date;
    }

    if (yearRaw === "2026") {
        return `${dayOrdinals[day]} ${month} две хиляди двадесет и шеста година`;
    }

    return `${dayOrdinals[day]} ${month} ${yearRaw} година`;
}