const numbers: Record<number, string> = {
    0: "нула",
    1: "едно",
    2: "две",
    3: "три",
    4: "четири",
    5: "пет",
    6: "шест",
    7: "седем",
    8: "осем",
    9: "девет",
    10: "десет",
    11: "единадесет",
    12: "дванадесет",
    13: "тринадесет",
    14: "четиринадесет",
    15: "петнадесет",
    16: "шестнадесет",
    17: "седемнадесет",
    18: "осемнадесет",
    19: "деветнадесет",
    20: "двадесет",
};

export function numberToBulgarianWords(value: number): string {
    return numbers[value] ?? value.toString();
}